**DATAFRAME QUESTIONS**

1.Create a data frame named df_students with the following columns: ID, Name, Age, and Grade. Populate it with data for 5 students. Perform the following operations:

  1.Add a new column Passed that indicates with TRUE or FALSE whether each student passed (assume a passing grade is at least 60).

  2.Select and print only the rows of students who are 18 years or older.

In [ ]:
df_students = data.frame ( ID = c(1:5),
                        Name=c("Vidhya","Sunder","Nandhini","Prasad","Anu"),
                        Age =c(23,18,25,23,17),
                        Grade=c(100,68,35,53,88))
df_students$Passed = df_students$Grade >60
df_students_above_18=subset(df_students,Age >= 18)
df_students_above_18

  ID Name     Age Grade Passed
1 1  Vidhya   23  100    TRUE
2 2  Sunder   18   68    TRUE
3 3  Nandhini 25   35   FALSE
4 4  Prasad   23   53   FALSE

2.Suppose you have two data frames, df_A and df_B. df_A contains student IDs and names, while df_B contains student IDs and their corresponding courses. Write R code to merge these data frames so each row contains a student’s ID, name, and course.

In [ ]:
df_A = data.frame(ID = c(1:5),
                  Name=c("Vidhya","Sunder","Nandhini","Prasad","Anu"))
df_B = data.frame(ID = c(1:5),
                  Course=c("CSC","EEE","IT","EEE","ECE"))
df=merge(df_A,df_B,by = "ID")
df

  ID Name     Course
1 1  Vidhya   CSC
2 2  Sunder   EEE
3 3  Nandhini IT
4 4  Prasad   EEE
5 5  Anu      ECE

3.Given a data frame df_sales with columns Date, ProductID, Quantity, and Price, write R code to calculate the total sales (Quantity * Price) for each product.

   1.Note: Generate your own data set.

In [ ]:
df_sales = data.frame(Date = c("10-02-2020","13-04-2020" ,"01-04-2021","23-05-2021","28-03-2021","10-10-2021"),
                      ProductID= c(01,02,03,01,04,02),
                      Quantity=c(1,2,1,1,3,1),
                      Price=c(100,150,200,100,90,150))
df_sales$total_sales= df_sales$Quantity * df_sales$Price
df_sales

  Date       ProductID Quantity Price total_sales
1 10-02-2020 1         1        100   100
2 13-04-2020 2         2        150   300
3 01-04-2021 3         1        200   200
4 23-05-2021 1         1        100   100
5 28-03-2021 4         3         90   270
6 10-10-2021 2         1        150   150

**4. For iris data set.**

  1.Calculate the average Sepal.Length for each Species.

In [ ]:
Average_Sepal_Length= aggregate(Sepal.Length~Species,iris,mean)
Average_Sepal_Length

  Species    Sepal.Length
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

2.Create a new column Sepal.Area which is the product of Sepal.Length and Sepal.Width.

In [ ]:
iris$Sepal.Area = iris$Sepal.Length * iris$Sepal.Width
iris

3.Find the species with the highest average Sepal.Area.

In [ ]:
Average_Sepal_Area= aggregate(Sepal.Area~Species,iris,mean)
Max_avg_area = Average_Sepal_Area[which.max(Average_Sepal_Area$Sepal.Area), ]
Max_avg_area

  Species   Sepal.Area
3 virginica 19.6846

**5.For airquality data set.**

1.Calculate the average Ozone level for each month, excluding missing values.

In [ ]:
# Removing missing values
airquality = airquality[complete.cases(airquality$Ozone), ]
# average Ozone level for each month
avg_ozone_level=aggregate(Ozone~Month,airquality,mean)
avg_ozone_level

  Month Ozone
1 5     23.61538
2 6     29.44444
3 7     59.11538
4 8     59.96154
5 9     31.44828

2.Determine the month with the highest average Ozone level.

In [ ]:
avg_ozone_level = aggregate(Ozone~Month,airquality,mean)
Highest_avg_Ozone_level = avg_ozone_level[which.max(avg_ozone_level$Ozone), ]
Highest_avg_Ozone_level

  Month Ozone
4 8     59.96154

3.Create a new data frame with Month and Temp columns, excluding days with missing Ozone values.

In [ ]:
# Removing missing values
airquality = airquality[complete.cases(airquality$Ozone), ]
# data frame with Month and Temp columns
df = subset(airquality,select=c("Month","Temp"))
df

    Month Temp
1   5     67
2   5     72
3   5     74
4   5     62
6   5     66
7   5     65
8   5     59
9   5     61
11  5     74
12  5     69
13  5     66
14  5     68
15  5     58
16  5     64
17  5     66
18  5     57
19  5     68
20  5     62
21  5     59
22  5     73
23  5     61
24  5     61
28  5     67
29  5     81
30  5     79
31  5     76
38  6     82
40  6     90
41  6     87
44  6     82
⋮   ⋮     ⋮
123 8     94
124 9     91
125 9     92
126 9     93
127 9     93
128 9     87
129 9     84
130 9     80
131 9     78
132 9     75
133 9     73
134 9     81
135 9     76
136 9     77
137 9     71
138 9     71
139 9     78
140 9     67
141 9     76
142 9     68
143 9     82
144 9     64
145 9     71
146 9     81
147 9     69
148 9     63
149 9     70
151 9     75
152 9     76
153 9     68